app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @gallery = Gallery.new(gallery_params)

    if @gallery.save
---
INSERT INTO "galleries" ("name", "city", "state", "description", "zip") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "The Whitney"], ["city", "New York"], ["state", "NY"], ["description", "A must see if you're in New York City"], ["zip", "10128"]]