app/controllers/paintings_controller.rb

  def new
    @gallery = Gallery.find(params[:gallery_id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 224], ["LIMIT", 1]]

  def create
    @gallery = Gallery.find(params[:gallery_id])
    @painting = Painting.new(painting_params)
    @painting.gallery = @gallery

    if @painting.save
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 251], ["LIMIT", 1]]
INSERT INTO "paintings" ("title", "artist", "gallery_id", "created_at", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Snow at Argenteuil"], ["artist", "Claude Monet"], ["gallery_id", 17], ["created_at", 2017-01-13 03:40:11 UTC], ["updated_at", 2017-01-13 03:40:11 UTC], ["year", 1874]]